app/controllers/documents_controller.rb

  def create
    @document = Document.create(document_params)
---
INSERT INTO "documents" ("pdf_file_name", "pdf_content_type", "pdf_file_size", "pdf_updated_at", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @document = Document.find(params['id'])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", 1]]